{
    "dreamer": "david", 
    "description": "David: teenage dreams", 
    "dreams": [
        {
            "number": "1", 
            "head": "01/02/90", 
            "content": "I was in the Grammar School playground, and this time Angela had taken off to somewhere in the school. So I ran over to Julie and asked her if she knew where Angela was, and she said: \"I can't tell you that.\" At first I thought she was just being a bitch about it. But then I asked her why. Then she sort of laughed and said: \"I haven't seen her all day. Why don't you talk to her brother over there?\" So then I walked over to the bus stop. I was greeted by a 7-foot-tall giant of a dork who said: \"Who the hell are you?\" I said: \"I'm David, have you seen Angela? He said, \"Yeah, she's in the school building.\" I said, \"Great,\" and started walking to the school. He stopped me, gave me a giant slab of masking tape rolled up to look like a joint the size of a cigar. He said, \"first let's play some games.\" We both walked out into the street to a cone, then stood there until a truck came by. Then we'd wait until the truck was a little bit away, then we'd run into the bushes pretending to swear in Spanish. We did this five or six times, then I woke up."
        }, 
        {
            "number": "2", 
            "head": "01/13/90", 
            "content": "Funny dream last night. Kinda hard to remember it all, except Steve and I were doing a lot of serious ass-kicking, and what's really funny, Michelle, who I haven't even given thought to in months, asked me out in this dream, in this soft, weak voice. I was either playing a video game or a pinball game, or I was kicking a soda machine that wouldn't give me its soda. Anyway, I was preoccupied, and when I heard her say \"Wanna go out with me,\" I stopped with an amused look on my face, and, after a silence -- presumably I was thinking -- I said, \"Sure, guess so.\" I woke up then at 9:30."
        }, 
        {
            "number": "3", 
            "head": "01/14/90", 
            "content": "Last night I had a dream I was in Payless, wearing my boots. I was returning a pair of shoes, I don't know if I got a new one or not, but I was thinking about returning mine."
        }, 
        {
            "number": "4", 
            "head": "01/14/90", 
            "content": "I was outside my house, at dusk, with Steve and Matt. I was wearing my boots. Also, Bill Murray was with us. we were running up and down the side of my road on that rise, like I used to do, when all of a sudden there were dogs. I remember my dog was there, and I knew the rest, but I can't remember them. Then I had a memory of something in a book (probably a hunting book) and I yelled something that made the dogs go away, but not before many bites by all of them."
        }, 
        {
            "number": "5", 
            "head": "01/14/90", 
            "content": "I was in K-Mart, by some kind of loudspeaker. I popped in a King Diamond tape called \"The Dark Side\" and was playing \"No Presents for Christmas\". And in the beginning I was thinking about how \"Santa Claus couldn't know about everyone, because it's physically impossible.\" I told Steve I played the song and he giggled."
        }, 
        {
            "number": "6", 
            "head": "01/25/90", 
            "content": "I drove the Buick to the DMV to get it insured."
        }, 
        {
            "number": "7", 
            "head": "01/26/90", 
            "content": "Our whole school went on this trip to Spain or France, I think, at any rate. The jet landed at the school, and everyone got out and went into the Pavillion. There were like 20 pay phones in there. I saw Angela walk towards the phones, I watched her for a sec, then cut in front of her."
        }, 
        {
            "number": "8", 
            "head": "02/18/90", 
            "content": "It was nighttime, and cold; I could see my breath. I was an outcast because the friends I had chosen were not socially acceptable. I was condemned to walk along on the grass and concrete for an unknown time. All of a sudden I meet Angela along the way. For some unknown reason I asked her what her name was. We talked and walked for a good twenty minutes and had a great conversation going. I felt great."
        }, 
        {
            "number": "9", 
            "head": "03/02/90", 
            "content": "For a while I dreamt I was having sex with Lisa and Cara. When we were done they sort of left and I hooked the modem up to my computer and I tried to call the BBS that was toll free. I never could make it through, and I set up a large \"boat-anchor\" TV. And I started watching a horror movie. It seemed all this was happening in the middle of the night. In the morning (in the dream) I went to B.J.'s house. I spent the night there, and every time I went out of the room to get water or something, I'd open the wrong door somewhere and my eyes would get to feast upon dead bodies and people and animals, all dead. Once I found Alice Cooper in a room with a 50's style band crowded in around him all behind tattered white sheets. All the people's skin was blue. The next morning I walked to Guitar Showcase. They were having a party there, and a guy named Heavy Harv was hosting. I pictured Heavy Harv as a 50 year old Mexican who wore 70's style clothes, with his shirt wide open. The funny thing was, they announced they were using Steve's records! I was hanging out by the wall, talking to some chick. I have no idea who it was, because in the dream, I never actually turned my head to look at her. I ended up buying something to hold pencils that cost eighty-nine cents."
        }, 
        {
            "number": "10", 
            "head": "04/13/90", 
            "content": "There was this girl with long brown hair. She was pretty. She was dressed in these green sweatclothes. She was being a bitch because she was making fun of me and my friends and laughing at the same time. She had two friends with her. Finally I got tired of it, and I pulled out a strip of metal, a thick metal bar. I hit her with it gently but firmly three times on her sides, legs. Then I suddenly hit her on the back of the neck. It went halfway through and I pulled it out. There was no blood, just a dark line where it went in. Everybody but myself ran away from her. Then I woke up."
        }, 
        {
            "number": "11", 
            "head": "04/17/90", 
            "content": "For some reason the school was at the Camp again. A bunch of girls from the school were doing a strip tease in the eating hall. It was pretty cool until Lisa noticed me watching, put her clothes back on and pushed me out of the room."
        }, 
        {
            "number": "12", 
            "head": "04/17/90", 
            "content": "I had this other one where I was at that dead field where they're building the homes. It was pre-dusk, same time most of my dreams are. The dead field was still there, though, and Steve had parked a new trailer there. A new trailer! We hung out there and listened to records 'til twilight, then I had to go home."
        }, 
        {
            "number": "13", 
            "head": "06/16/90", 
            "content": "I am in hell. It is a frozen, barren wasteland filled with screaming souls. The icy wind cut through my skin like daggers. Satan appears as a huge black cloud that demons flew around, changing from twisted shape to twisted shape."
        }, 
        {
            "number": "14", 
            "head": "06/20/90", 
            "content": "I dreamt Mr. N had a gun, and was holding all the 6th grade teachers (but Mr. P) and a bunch of students hostage in his classroom. I think Mr. M owed money to Mr. N, so he got the hostages. He was getting ready to shoot James because Mr. M was taking too long. So Cara stopped him by stalling him. She stalled him right until this part ended. Then I dreamt I woke up, and went outside to play frisbee with my grandpa! It was on Green Drive, and I accidentally threw the frisbee over the highway near Green Drive. Right then Chris (\"Smokey\") came by. He was dressed up in a colorfully striped Dairy Queen uniform. He had a great big map and asked me for loose change!"
        }, 
        {
            "number": "15", 
            "head": "06/10/91", 
            "content": "Tim was in bed with two girls. I climbed in and did drugs with them. I was down by a lake. Richard was trying to drown me. There was an open garage. A black guy was running for his life towards it and Matt was chasing him."
        }, 
        {
            "number": "16", 
            "head": "05/17/92", 
            "content": "Set in a desert, at night. I had taken a trip in an airplane with Amy. She was wearing the traditional desert garb, for fun it seems. I was wearing a coat. Apparently, we had broken some kind of law because we were about to be executed with guns by soldiers on a stretch of the desert. Time passes. Back in the desert. Amy and I have escaped execution somehow. Rumors reach me that Tara is also in the area, and has been attacked. I run into her eventually and seems she has been stripped of clothing, but not much else. I am angry that someone would do that. I provide her my coat. She is very flustered and I find that I have to comfort her. When she has calmed down, I find Amy and we all find refuge in a cave, in which we fall asleep. There is a moment of darkness, and then I wake up (for real)."
        }, 
        {
            "number": "17", 
            "head": "05/17/92", 
            "content": "I'm in the computer room at school, only the windows are gone. Mr. S is not there. Instead, there is some woman with very short hair. I scrawl a name that isn't mine on the wall with a pen, and wipe it off later. Later I am still at school, only now in the theater room. Mrs. P announces that she is going to try a musical rendition of her lesson. I tell her that I play the guitar, and will be happy to learn the guitar part. Amy is near me. She asks to be taught a few chords. (After class.) I teach her the chords A, C, and E."
        }, 
        {
            "number": "18", 
            "head": "07/22/92", 
            "content": "Amy and I were together, watching some show on a couch, and she was massaging my back."
        }, 
        {
            "number": "19", 
            "head": "11/05/92", 
            "content": "Heather and I were in the kitchen. She was sitting on the counter, speaking in Spanish. I tried to talk to her, but all that would come out was French. She jumped down and put her arms around me and kissed me, but we couldn't communicate. No matter how hard we tried, neither of us could understand what the other was saying, and for some reason, neither of us could force our lips to make English words."
        }, 
        {
            "number": "20", 
            "head": "01/22/93", 
            "content": "I drove my car to school, and parked it behind the music building, right up next to the fence. I had something in my hand which my inner voice kept referring to as a Blitz, and I didn't want it. It looked a lot like a candybar. I rolled down my window and threw the Blitz out. The Blitz struck the fence with a hollow rattling sound and dropped from sight."
        }, 
        {
            "number": "21", 
            "head": "01/22/93", 
            "content": "I was walking down Green Drive in the middle of the night, heading from Quik Stop back to home. It was raining very hard, and I was wearing a raincoat. I got to the shopping center, and I went into the parking lot. I looked around myself, and my attention centered upon Home Video. So I pulled a key out of my pocket and unlocked the door, pushing the door open and walking inside as I did so. The interior of this building was not much; it was about six feet square and looked like a repair shop for VCR's. Parts of VCR's lay strewn about the floor. I grabbed a movie, after much consideration, and left five dollars on the counter. My biggest concern at this point was to get back out with the movie in hand and yet not be suspected by the police as a theif. For some reason, I could not get back outside for a long time. This dream ended when I crossed the threshold into the parking lot."
        }, 
        {
            "number": "22", 
            "head": "01/22/93", 
            "content": "In my last major dream, it was wartime. Rather, it was as though a war had passed, and I was the bodiless witness to the carnage. My attention focussed upon one poor man's bloody upper torso. His body had been ripped away from the waist down, and his eyes stared blankly into the void. He had a crewcut, and in portions of his facial skin, you could see the underlying skull. I could tell, from my astral vantage point, that he had begun to rot.  Suddenly a dog came along. It was a small dog, perhaps six inches tall, opne foot long. Brown patches splotched its fur. I do not know whether the patches were natural or the result of some other occurrence. At any rate, the dog too took an interest in the carcass, and grabbed the man by the arm, dragging him along to wherever it was going. The dog dragged this man over hills and rocks, through fields and lakes, through forests and mountains. As the dog did all this, little bits and pieces of the man kept falling off- he was being eroded away. Finally the dog came to rest with the man's remains, and I realized that they were laying at my feet.  I knelt down and examined the man. He had been nearly completely decomposed; he now had no chest, with the notable exception of a few jagged ribs. His skull was nearly intact, but now he had no eyes. Most of his skin had fallen away, only leaving a large sheet covering his back (which was unusual, since the dog had been dragging the man along his back- not his frontside!) The man's arm's (now skeletl) were intact. During this examination, I left my own body and became a witness to the scene. I think I was watching from the point of view of the dog, because I was low to the ground. This dream self said: \"Wait, there's been a mistake. This man is not quite dead yet!\"  Then I was watching the scene from above my own head. I saw blood pulsing within the skin of the skeletal form, and I began thinking to myself: \"Oh god. This is going to be like one of those cheesy horror movies where the skeleton comes to life and strangles the guy.\" but that was not what happened. Down there, I pulled out a gun and tried to shoot the skeleton, but the shot did not harm it. Its jaw worked, and it reached for an antenna which was laying nearby.  It aimed the antenna at me, and it pulled an imaginary trigger. My head was suddenly filled with the wrenching noise of a telephone's ring, and suddenly, I understood what the skelton was trying to show me. It was illustrating for me that men are forced to be like machines in war. Further, when machines perform their duties, it is like getting a phone call; they (the machines) always involve people in some way. Conversely, when a man is killed it is as though he is receiving a phone call from the gods. The man always finds a way to involve one of them in his death. Hah!"
        }, 
        {
            "number": "23", 
            "head": "01/23/94", 
            "content": "I had a school dream last night. It was actually kind of frustrating. I wanted to get my classes changed, but first, I wanted to get my geometry class changed back to Mr. St's. I suppose I was at someone else's house, and Mr. St called, to check on this person, to see if they were cutting class. I connected Mr. St to the parents of the household, and as I hung up, I commented: \"You know, Mr. St *does* sound like Rush Limbaugh over the phone.\"  \"Thank you!\" I heard him reply. Then I hit a button to hang up.  Then I was standing in a long line at his desk. All these people, including me, wanted to get back into his class. The line was so long, that I whipped out an entire steak dinner and began to eat it in line. By the time the line had gotten down to the last few people and me, I only had one bite left on my plate: some of the steak. So I bit into it. It was the worst, most god-awful steak I had ever had in my entire life, I was sure of it. It was dry, and tasted like roast beef. What's worse, as soon as I began chewing it, the bite expanded in my mouth and filled it with this awful roast beef stuff. I had to let everyone else go ahead of me, and I still wasn't able to talk by the time Mr. St had gotten up and left. So I fell asleep (in the dream), and when I woke up again, I was again at the end of a line. I stood up, and I found that my balance was so bad that I kept falling down every time I stood up. Again, by the time I had finally gotten my balance back, Mr. St had gotten up and left. That was frustrating."
        }, 
        {
            "number": "24", 
            "head": "01/24/94", 
            "content": "My brother and I were standing outside of a giant green lake. I knew that this was a \"sea world\" kind of thing, where there were shows and stuff. At any rate, we were standing on a ledge which was perched over this giant pool with green water, and I noticed two people in the far corner of the lake: an old lady in a diving suit and my dad, talking to her. My brother, I guess, fancied himself a performer of some sort, and he was standing at the very edge of our ledge, threatening to jump into the lake at the next exhibit. I could see that he held in his hand several sheets of music, professionally printed, with each bar being two half-note chords, second-inversion ninth chords in C. Each chord was the same chord. I could see seaweed and other things floating around in the lake, and I decided to ask my brother whether jumping in was such a good idea; does he know how deep it is in there?  My brother replied, insolently; \"Of course I do! I know what I'm doing!\"  So I laughed. The next show was going to be the killer whale show, and when it was announced, my brother hesitated, long enough to see a monstrous black shark-looking thing emerge from the water. The lake had, at some point, changed into an incredible swimming pool, but the water remained green, and everone remained where they were. My brother decided not to jump. He laughed kind of feebly, and said: \"Oh, maybe you're right, David.\" Then he sort of faded away. The next thing I knew, I was in the water. The giant \"killer whale\" was coming towards me, but I didn't care, because killer whales are reputed to be harmless. I wouldn't drown, anyway, because I was walking on the water. So the giant killer whale careened at me, and I'm not sure what happened next, but at some point I ended up in the water, with the killer whale some distance away. I swam up, up, up, and the water followed me. The old lady in the suit warned me: \"you're not going to want to have such a strong reaction to him.\"  It didn't help, anyway, because soon enough, the killer whale had pinned me against the towering pool wall and was trying earnestly to roll me into a pulp. I woke up feeling spasms in my back which simulated the way I felt in the dream."
        }, 
        {
            "number": "25", 
            "head": "01/25/94", 
            "content": "Well, I don't remember any dreams, per se, but I do remember a vision of a stack of videos, all with blue covers, like the ones Home Video has, and they were all marked with X's."
        }, 
        {
            "number": "26", 
            "head": "12/14/94", 
            "content": "Last night I had the most convoluted dream about Laura, Josh, Hannah, Grace, and Grace's poetry that she had written for Andy Warhol. In the dream, poetry was represented by these very geometric, and angular figures, with strange curves and endpoints. I tried to make a drawing of them when I woke up but didn't do it very well. Not least because they were 3-dimensional. You wrote them into the thin air with your pen. In the dream, I drew a \"poem\" from Hannah's chin, and I said: \"You're a poet now!\" We all laughed. I seem to remember the dream was mainly about looking for Laura. She was around, just hard to approach because she was elusive."
        }, 
        {
            "number": "27", 
            "head": "06/14/95", 
            "content": "Alright. I'm in J City, but it's sometime way in the future, so the city is as big as Los Angeles. For some reason it's really warm and humid, and feels like San Antonio. The first few seconds of my dream are set in the daytime. I drive my car up to the top of this really big hill, and I come to an intersection where I can't make a right turn for some reason; it's a one way in the other direction or something... at any rate, the road is blocked off. So I park my car in this downtown section where all the buildings are sort of greenish. It reminds me of what I think of when I think \"Jungle\". The air is really, really humid. At any rate, I'm either looking around for a Chinese restaurant or my friend's house. I can't remember which but it may have been both. One way or another, I keep getting lost in this little tiny two-block area of huge green buildings, and this really attractive Italian woman comes around in front of me and says: \"You're ----, aren't you?\" She said some name, but it wasn't mine in real life. It was mine in the dream, though. So I said \"Yes, I am.\" I probably would have agreed if she didn't say my name. She was absolutely gorgeous.  Anyway, it's been nighttime for a few hours, dream time. I have not been able to find the Chinese restaurant. So the Italian woman takes me by the hand and leads me through all these wierd back streets among these green-tinted buildings and we finally arrive at this one nice looking house that looks sort of like a greenhouse with wooden frames. Plants are growing everywhere, and I keep hearing congo drums someplace. So I get into this house, and the woman sits me down in the kitchen, at the counter, on a stool, like it's a bar or something. Then, she just kind of disappears, not to return until later in the dream. I get pretty bored listening to the congo drums, and so I get up to look for the Italian woman. Then I find this little tiny room with an absolutely huge mattress on the ground, tons of congo drums everywhere, and a REAAAAAALLLLLY fat guy playing the congos.  So as soon as he sees me, he jumps up and shakes my hand. He's really sweaty. I almost don't want to touch his hand. He's wearing this white cotton T-shirt that doesn't quite fit, so his belly is just everywhere. It's really gross to look at, so I look away. Apparently this fat guy is some kind of amazing musician that gets paid millions an hour to play congos, and he has this entire house just for playing music. Or so he says.  So we go back out into the kitchen, and along the way, he loses about 200 pounds. For some reason, it doesn't matter that much to me when that happens. The Italian woman is back in the kitchen, now wearing an apron. Now a really good looking blond woman has joined her. The fat guy introduces me to them, but I can't remember their names. Now, this blond kinda skinny guy arrives on the scene. he has longish hair, and he looks a lot like the male version of the blond woman. So there's a few minutes of conversation, and the fat guy drops another whole load of fat, and now he's starting to look pretty average. He eventually suggests that we all go back into the bedroom, and we all go back into the bedroom. Then we all take off our clothes. A few moments ensue, which aren't really sexual on anyone's part, just a lot of kissing and stuff. Then, The fat guy, who by now looks great, and the skinny blondish guy have an announcement to make.  The by-now great looking guy says: \"Well, the two of us are... straight,\" then they look at each other, \"but we're gay, too.\"  The blond woman is obviously disgusted, and she says so: \"Oh my god, that is so gross. Here, let me show you this.\" And she immediately produces a copy of \"THE WIZARD OF OZ\"!! She says, \"Here, read the last three pages,\" and starts ranting. I refuse to read the last three pages, and she hits me over the head with the book. I put my clothes back on and kept looking for that Chinese restaurant."
        }, 
        {
            "number": "28", 
            "head": "09/01/95", 
            "content": "I'm making out with Laura in my room and there's a bar of this white deodorant-like stuff. It's caky. This is supposed to be spermicide. She grabs it and we strip down. She rubs the \"spermicide\" all over her body, lays on the bed, cocks her pelvis upwards and claims: \"I'm receptive!\" But I've had to piss the whole time, so I tell her I'll go do that. But as I run for the bathroom I hear my family come home. I scramble and get the key for my room so I can get back in there without letting on there's someone in there, much less Laura in such a \"receptive\" mood. My brother asks me why I'm locking my room and I tell him bluntly that there are things in there I don't want him to see. I still have to urinate, but while I'm trying to lock the door, Nick uses the bathroom. My mother walks into the bathroom, and then walks back out, assuring me that there is \"plenty of garbage\" in that bathroom. By now, the feeling that I have to piss is so strong I feel I'll burst. My mother keeps going back into the bathroom and coming out, assuring me there's \"plenty of garbage\" in there. In frustration I finally just start pissing all over the walls in the hallway."
        }, 
        {
            "number": "29", 
            "head": "09/01/95", 
            "content": "I dreamt I woke up at seven and got ready for school. I got in an argument with my brother and ended up one hour late for class. In between two classes I made a quick jaunt down the coast."
        }, 
        {
            "number": "30", 
            "head": "12/24/95", 
            "content": "Something about the Capitol building in Washington DC. The stairs were greased. I also remember looking at photographs of a young, very attractive, mousy woman who was supposed to be named Cheryl. These were photographs of the young Cheryl, who supposedly was old and decrepit by now."
        }, 
        {
            "number": "31", 
            "head": "12/25/95", 
            "content": "My father was searching for a job. I can't remember what happens next. I need to go to work, but my brother's walkman has a leak in it. And my car (actually Jimmy's hatchback) is \"broken\", though my Dad drives it down to the Chevron station to get it fixed.  I need my car to get to work, but in the meantime, I go down to Jimmy's house for a bit. When I walk back up, there's some kind of bear/cat/monkey creature in the road. It has a dark, black face like a monkey, and sharp fangs and claws like a cat. It has light grey fur all over it's body, and bounds around on all fours. It is scared of me, so as I stroll up the road, it leaps up into the trees and walks back around me. I figured it was going to go back to eat the stalks of grass, so I didn't care much. But the next thing I knew, with a symphonic crash, the bear thing has bitten into my hand, and we are spinning around in a circle rapidly. We get into a huge struggle, but miraculously, I just get scratched up as if I were fighting a cat. The dust clears, and I somehow get the cat thing to call a truce. We start to walk up the road together, and it stands erect and turns into a human being. I comment, \"I should have told you I wasn't going to hurt you. That might have saved you some trouble.\" He replied, \"Yes. I would probably have gone right back to eating.\"  We get to my house and we walk over to the deck. Jimmy's waiting there for us. Just then my Dad re-surfaces in the car. My Dad walks over to me. He's wearing a dark blue uniform that looks like a policeman's uniform, or a military uniform. It is well fitting and has plenty of shiny brass buttons, as well as a short-brimmed policeman's style hat. He pushes his hat back on his head. The bear person disappears. I notice for the first time that over my Dad's right breast is a patch with an American flag and the Chevron symbol. \"I got a job!\" he says, \"At Chevron! Although they're closed...\"  \"They're closed?! I have to get to work in...\" I look at my wristwatch and see that I have half an hour before I must go to work. My Dad says, \"That's O.K. Now that I've got a job there, I've got all the tools!\" And then he immediately sets to work on my (Jimmy's) car.  Meanwhile, my cuts and bruises are just throbbing, so I rush down to the bathroom and strip naked so I can see what damage has been done. I am covered with shallow slices, all of which have already scabbed over. I still go for an application of Trisporic everywhere, which burns. I notice that my black mug is filled with mint tea, and I'm careful not to get any dandruff, hair, snot, blood, etc in it. I take a big gulp of it, and find that it's lukewarm. I remember that I left it there several days before, and marvel at the cup's ability to keep things warm. Then I search around in the medicine cabinet behind the mirror for painkiller pills, and I swallow them down with tea. Out loud, I say: \"This really keeps things warm, I can't believe it! I left it here like a week ago and it's still warm!\"  Next, for some reason, I pull out two large pieces of tinfoil, and suddenly feel the urge to put something repulsive in them. I start to throw up, but then I remember I just took some medicine, so throwing up for fun would just be a real waste of medicine. I stop myself just in time and manage to keep my stomach down. The next thing I consider is taking a shit in the tinfoil, but I discard that idea right away, because it would probably be too squishy and I would probably get some on my hands. I give up, and I start to crumple the foil together, when I suddenly get AN IDEA! I hock up, and attempt to spit out, an enormous mouth-sized snot and phlegm ball. It is spongy and porous. My revulsion at this repulsive choice wakes me up."
        }, 
        {
            "number": "32", 
            "head": "12/25/95", 
            "content": "A massive quest for pornography. Everyone was searching for porn. It's too vague for me to remember, but I recall videos laying in the street, a magazine on a table. Then I ended up at the junior college library, which was a horseshoe shaped parking lot/cafe/criogenic freezing lab. Everything was dark and smoky. I walked up one of the aisles and noticed a coffee-and-muffins stand. I thought to myself: 'How hypocritical. This is just like a movie theater. They tell you to leave your food and drinks outside and then sell you coffee and muffins while you read.' I had dived into the 'library' to avoid Eric, an irritating friend. That's when I noticed the criogenic freezing slabs. There were five of them, and each had a Windows display on the side of the slab. The slabs were orange concrete, and the criogenically frozen people were all just laying on top of the big orange blocks, under a set of flashing sheets. Each block was numbered, but only four had people laying on top. The life status of these four were displayed on the Windows 'status bar'. This information was transmitted via wires in the flashing sheets. I then realized that these slabs weren't real at all, but a publicity stunt orchestrated by Devo. I laid down on the free one and pretended to be asleep, under the criogenic flashing glow-in-the-dark electronic Devo sheets. Eric came along and looked. \"How long you been asleep, man?\" he asks. I didn't respond. Someone told him to check out the display. Eric went away eventually, and I decided to get a book. I eventually found a copy of Finnegans Wake, only it was in this orange folio edition. It looked exactly like a book of methanol and ethanol emissions ratings that I had just returned. I ran around the library, waving this folio in hand, proclaiming: \"Everybody should read this book! The questions to everything are in here!\" The edition came off of somebody's typewriter. I opened it up to the first page, and recopied the bottom printed half onto the blank top half of the page, thinking all the while that \"this page needs some filling.\" It occured to me that since Joyce was a Catholic, it's likely that some of the answers to the questions in Finnegans Wake are in the Bible. I search for a Bible in the library, but on the shelf in place of Bible, between two books, is a large, soft blueberry muffin, abandoned to fate. I eat it."
        }, 
        {
            "number": "33", 
            "head": "12/28/95", 
            "content": "I lived in this strange house, where video games, toys and other inanimate objects came to life and mixed with the living. It started at school. I was going around, trying to take my finals. I get to my PE and Math finals, and look on my sheet of paper. Damn! They're being held at the same time! I take a look at the teacher's name. Patterson. This guy was the quintessential chaw-munchin football coachin' American bastard when I was in the 10th grade. I think, \"He WOULD follow my to college and ruin my life. Just to ruin my life.\" So I run over to his final, do it very quickly, and then run all the way back across the campus to do my math final as quickly as possible. I remember that I've never been to the class, but I breeze through the material anyway. I hunt around in empty classrooms for mathbooks and dictionaries to steal. Once I've got my backpack loaded up with valuable \"study materials\", I'm all ready to go.  All of a sudden, I realize I'm not at college at all but at home, and my parents have arrived with some Africans in tribal gear and colorful robes and neck rings, and are having tea with them. I stay downstairs, just so I don't have to deal with my family. Then, as usual, I have to go to the bathroom really bad, and I keep trying to piss in garbage cans. That doesn't work out too well. As I'm trying to find a garbage can to piss in, some person materializes out of nowhere, comes up to me, and shows me his \"closet\", which is filled with toys that come to life. To demonstrate, he activates one especially ugly one, and it nearly beats him to death. It gets me a little too, but I escape."
        }, 
        {
            "number": "34", 
            "head": "12/28/95", 
            "content": "I dreamed that I was in some kind of medieval landscape, laying in the base of a cylindrical tower with my enemy. Guess it was a dungeon. We conversed for a while, very politely and pleasantly, but then, it suddenly came to him that I was after him and after a brief struggle, I leapt out of the dungeon-hole, knowing that he was superior. Everything melted, and the next thing I knew, I was in a supermarket. I see these four painted canvases of cavemen, in the Flintstones leopard-skins that hang on one shoulder, looking very strong, with the legend, \"Christian Soldiers Unite!\" written across them. Suddenly, all the canvasses of cavemen are lowered, and I see that they're being held up by two bare-chested boys and two bare-chested girls. But, as I get closer, I realize that they are all girls, as one of the older ones takes off her shirt. I find the Christian leader eventually, who's a middle aged man, and I ask him about the girls. He mumbles something, and I beat him up. My friend Bonnie sees this and she tells me that she is very impressed."
        }, 
        {
            "number": "35", 
            "head": "12/28/95", 
            "content": "I'm walking around downtown in my raincoat and hat, not really knowing what to do. A woman comes up to me and asks me for change, but I remind her that she's already asked me twice today. She groans and takes off to a group across the street. \"Wow!\" I exclaim to myself, \"Amy is over there!\" I hadn't seen her since Junior High, so I walk over to her and say hello. She gives me a partial hug and we talk for a while. After a brief conversation, I pretend to be a Mafioso, and I look across the street at all the brand new seventeen story magnificent gleaming coffee places. I hop across the street, and take off my jacket. An old lady walks up, and I whisper something to her in Italian. She nods knowingly, and disappears. I put my coat back on, look around shiftily, and go inside and get an espresso."
        }, 
        {
            "number": "36", 
            "head": "12/29/95", 
            "content": "I was standing upon a beach with a huge milling crowd of people. I didn't really know what was going on, but it seemed to be some sort of good-natured rock fight. People were picking rocks up and flinging them playfully at each other. They weren't pebbles either, they were ROCKS. Then, everybody started going crazy, and it was like a battle. People were throwing to kill. Talk about a shift. Then a gang called \"VS\" showed up, and things really got vicious. One girl got me good in the stomach with a big rock and I followed her around, determined to kill her. As it turns out, it was one of my brother's old friends, who he \"hates\" now."
        }, 
        {
            "number": "37", 
            "head": "12/30/95", 
            "content": "An abstract dream: I dreamt about patterns, shapes, colors, and lights."
        }, 
        {
            "number": "38", 
            "head": "01/01/96", 
            "content": "I'm sitting outside with my friends on a massive lawn. We are having a picnic or something. I suddenly realize, as I stand up, that when I press down on the raw earth, I can make sounds. Every time I push down on a place, it forces some air in air pockets out through the grains of dirt, and it makes a farting noise with a note to it, kind of like a tuba. After playing a bit of a song, the earth becomes seriously disturbed, and big rocks and chunks of brick lay everywhere. I guess we had too much fun. Music seems to emanate from beneath these bricks. After we replaced the earth, and I \"play\" it a few more times only to get the same results, we realize that the underground brick and concrete structure is part of a prison. In fact, the part where they put the most dangerous criminals, and we all struggle in vain to replace the bricks and concrete and dirt before it is too late and the prisoners escape and kill us!! The dreams ends when I jump off the ground and fly away."
        }, 
        {
            "number": "39", 
            "head": "01/02/96", 
            "content": "The first thing I remember is a dream in which I was eating food out of somebody's hand. Now I'm sitting up in bed. My maternal grandfather appears at the foot of the bed, and asks me \"Can you EVER forgive me?\"  I said, \"Of course! if you hadn't been such a bastard, I wouldn't have had this life!\"  Then he asks, \"Is all my money going to end up in ... little pockets?\"  I said, \"I don't know.\" Then I apparently woke up, the alarm went off, and I was sitting in the office, kind of sweaty from sleeping in my clothes. It turns out that the alarm was actually the ringing telephone. It's the lunch hour. My supervisor, Ed, (middle aged balding guy with long hair, really greasy and wears glasses, very unclean person.) rushes in, getting things ready. He picks up the phone and begins to deal with the customers, and as usual, another line suddenly lit up, and I had to deal with this person. The person on the telephone was an old lady. An old, deaf lady trying to order some kind of lunch that wasn't on the damn lunch menu. Plus, she was talking too quietly. \"I'm sorry, could you repeat yourself?\" She muttered again. \"I'm sorry, I didn't hear that. Could you speak louder please?\" She mutters again, and in vain I try to turn up the speaker on the phone. Finally I think \"Why am I apologizing? SHE'S the one causing the communication problem!!\" \"GOD DAMMIT!\" I yell. \"SPEAK UP! I CAN'T HEAR YOU! CAN'T YOU TALK LOUDER?!\" I thought, 'I hope El's put me on the clock for this.'  Finally Carrie, one of the drivers, comes in and gives me this look like, \"Stupid customer, huh?\" Then I really wake up."
        }, 
        {
            "number": "40", 
            "head": "01/03/96", 
            "content": "I was scheduled to go to the city with Brad and Jimmy at five or six PM. I was getting ready to go when my brother came in needing help on some stupid class assignment. I helped him for a while, and when I looked at the clock again, it was 8:00pm, and too late to go. I yelled and I screamed and made a fuss. I went to the library, checked out, and read, a book on the various forms of fussmaking. And then my room was getting dark. The hair fell out of my picture of Grieg on the wall. Instead of striking me as odd, this just scared the shit out of me and I \"woke up\". I sat up in bed, leaned forward, and kind of examined the floor underneath the Greig picture. I turned on the light and everything. After I was finally satisfied that hair had not fallen out of the picture, I had a dream involving the little theater downtown. The theater had just gone out of business and the proprietors had turned it into an antique shop. I thought this was a disgrace. At the very least they could have turned it onto a film museum."
        }
    ]
}