{
    "dreamer": "jeff", 
    "description": "Jeff: a lucid dreamer", 
    "dreams": [
        {
            "number": "001", 
            "head": "01/30/2000", 
            "content": "In my dream, the first thing I remember was this very nerdy guy that goes to my school (in my opinion he was the biggest nerd at my school). So, then I saw a girl talking to him, and all of a sudden she kissed him. Just that event was so dramatic to me, I started crying selflessly at what had just happened- a completely beautiful girl kissed this complete geek, and I was so touched by that moment, that I think I fell in love with her on the spot and realized she was the most beautiful girl I'd ever seen. Later I caught up with her at a cafe of some sort, and sat and talked to her, but I didn't want to tell her how much I liked her because she might have thought I was trying to take advantage of her, and with such a nice girl, I wouldn't want to do THAT."
        }, 
        {
            "number": "002", 
            "head": "01/30/2000", 
            "content": "The next thing I know, I'm in this big, fairly dark room, and my old female teacher, Mrs. Jones, is there. It was right before a school trip to Vacation State, and I looked at the clock-- as soon as I looked at the clock, the hour hand went around the clock faster than a second hand normally would. Distorted time is an interesting thing in dreams- it's probably where Salvador Dali got his idea for the painting. Anyway, before I know it the Vacation State trip is over and I missed it. I saw Mrs. Pappas outside after that and she asked me why I wasn't there. I don't remember what I told her, but I didn't mention the distortion of time in the dream, it seemed completely normal like, \"oh no, there goes time again\" and it was my fault I missed the trip."
        }, 
        {
            "number": "003", 
            "head": "02/08/2000", 
            "content": "Last night's dreams are a little fuzzy in my mind. I remember living somewhere seemingly far away from my own home- most likely somewhere in the country, but I don't really remember any buildings. I remember meeting two girls there who I thought I had met once previously (in dreams, I guess, maybe the same night). For some reason I wanted to be really friendly with them, and I felt some kind of personal attachment. I don't remember much about them, except that they lived far away (Although it seemed I was far away from home, I think they were even further), and I wanted to keep contact with them. Then, I was away from them for some reason, and I was thinking of things I wanted to ask them next time I saw them, such as if I could have their address/email address and if they wanted to stay \"friends forever\". Then, when I went to look for them, they were gone- just left, gone back home. At that time I was in a house that very much resembled my grandfather's house (dreams are weird in that you always know something looks familiar, but can only guess if that wasn't what it was supposed to be, or if you really did make that connection in the dream). There was a small van (it was definitely the same van we went to the college Model UN in), and I saw someone get inside, Mr. Rosetti I think. And as far as I knew, we were going into the city for a school trip. On the van (which seemed more like a really big, fancy bus when I got in there), there was a guy lecturing us about something. I was so tired, half-asleep within my dream; and it was a weird situation. It was kind of like a partial dream within a dream. The lecturer asked a question, and in my \"dream\" I imagined I knew the answer so I raised my hand, and when he finally called on me, I said I didn't know the answer, and I only raised my hand because I was half asleep and I imagined either I knew the answer or that he was asking a different question. I don't remember anything after this."
        }, 
        {
            "number": "004", 
            "head": "02/09/2000", 
            "content": "I woke up this morning knowing I had a dream immediately before but I couldn't remember what it was about, so I decided to just let my body relax and thoughts from the dream flowed back into my head. All I remember is complaining about somebody putting the Barenaked Ladies song \"McDonalds Girl\" into the school newspaper, which in my dream I believe was called \"El periodico\". So, I was complaining to my school principal, trying to take apart the lyrics and explain why they were offensive to me. Of course, I wasn't really at all offended by this newspaper submission, but I still complained to the principal, Mrs. Lear, about it. Actually, I knew that there was no newspaper submission in the first place (I was just making it up), but I still felt the need to complain about it. Then, all I remember is talking to the person I blamed for the submission of the article, and he shows me the image of a little lego boat; and he told me something about the ship having sunk, or being about to sink."
        }, 
        {
            "number": "005", 
            "head": "02/25/2000", 
            "content": "I remember being in Africa- a quiet wooded scene outdoors. I think it was a school trip. It was night, and it was rather warm and the air felt humid. I remember being in my bedroom or one much like it, and many frail looking boys coming in- many of them wearing the smallest bit of clothing. I felt rather bad for them, and realized how hard it would be for me to live like that. There were at least 2 beds in the room, and about 5 or 6 boys got into each bed. It also seemed like it would be too crowded if I also got in the bed- I'd barely fit, and I like having room. All I remember thinking is that since there were so many people on the beds, I'd rather sleep on the floor. They didn't say a word. Then I'm in a hotel. Certain doors I wasn't able to open, maybe. I don't remember much, but recollection of it makes me shiver (even though the dream didn't seem too bad when first experienced). There's some recollection of being trapped somewhere, although it didn't feel too pressing of a situation."
        }, 
        {
            "number": "006", 
            "head": "02/27/2000", 
            "content": "I dreamed I was walking through the middle of New York City, yet it didn't really look too much like a city. There weren't enough tall buildings and people. I came to this area with a bunch of homeless kids, and one of the boys asked me if I'd be willing to trade a dollar for a quarter. After looking into my pocket I found I had several hundred dollars with me, so I gave him my dollar. I told him he could keep the quarter but he gave it to me anyway. There was a girl, who upon seeing a bowl on top of a trailer, wondered if there was any food in it. Unfortunately, I had to answer that there wasn't any food in the bowl. Then the idea came to me that I could take her out of that ghetto area, I could show her a better life, and we could have some fun. So I asked her if she'd like to come with me, and I admitted I had some money. She said she would. For some reason one of her friends came with us too. We were walking, and I decided to ask for her telephone number. She gave me a really weird answer, although it did start with my area code; it was something like: 611-832f-9,dt. I told her I didn't know there was a comma on the telephone, and she told me she didn't either (after looking at the telephone, I found it was one of five or six symbols below the \"0\" key). She told me that was the number for her dorm, or something like that, but I didn't even think that she's homeless and probably wasn't old enough to go to college. I lost sight of her at one point and decided to call her on one of the many nearby phones. Of course, when I called the number you can expect that I'm not really calling a telephone, I'm calling HER- that is, the nearest telephone to her would probably ring. But I guess just about when I picked up the phone, she came into view and I told her I'd been looking for her. So, then we went to the amusement park, and got on a ride where you're sitting down, up to your waist in water. I don't know what the ride was supposed to do. But at that point, the girl (if, in fact, I did know her name, it was probably Julia, because that's the first name that comes to mind when I thought of her), the girl started floating in the air. It seemed a rather normal experience, and I said, \"Oh, no, how do we stop her from floating?\" I don't remember what happened after that, except that she was gone. Then, just outside the amusement park, there was a computer, a very eccentric type of computer. I was typing song lyrics into the computer. They were my own song lyrics, and I was amazed that I was typing really good lyrics without really thinking about what I was typing. I often try to write song lyrics in real life, but they never sound just right, even though I think deeply about what I'm going to write. But here, miraculously, these perfect song lyrics were being typed out by me (I'm not sure how good they would have sounded if I heard them in the physical world). There was an interesting little program on this computer that allowed me to integrate the lyrics into an actual song, just by pressing a button. The lyrics sounded excellent when put to music- in fact, I think the voice I heard singing my lyrics was none other than Steven Page, lead vocalist for Barenaked Ladies. It was my own song, yet it sounded like something Barenaked Ladies might have done- one of my real life goals (to write a song comparable to Barenaked Ladies)! Well, the next thing I remember is being in a room, and seeing the girl that just floated away on me. There were a few other people there, and I just sat down, on a couch opposite the one she was sitting on, and waved."
        }, 
        {
            "number": "007", 
            "head": "03/03/2000", 
            "content": "My first memory was seeing this blonde girl that looked familiar. When I asked for her name, she said Michelle, and I playfully jumped on her. When she acted surprised, I said, \"Oh, sorry, I thought you were another Michelle.\" She said her name was Michelle. (There is a senior at my school with the same last name, but I donÕt know anyone named Michelle.) Yet the name sounded very familiar, even to the point that I checked my old yearbook for someone with that name after I woke up (without success). In my dream, she was probably related to Alex in some way, and she was a shadow at Prep Academy. I wanted her to shadow me, but she went with someone else instead. I was supposed to be in class, but went into another room to look for Michelle. Instead I found some people, presumably teachers, since the one person I knew was Mr. Grant (Some of the others seemed to know me, and shook my hand, but I didn't recognize them)."
        }, 
        {
            "number": "008", 
            "head": "03/03/2000", 
            "content": "I was walking through a hospital, and there were people on life support. The cords connecting them to the support went through the only place that I could walk through, and since the lights were rather low, I was afraid I might accidentally knock out one of the plugs, or someone might trip on them. Then there were 2 teachers, Mrs. Pappas and Mr. Dell. I think Mrs. Pappas told me to turn a dial or press a button, but I didn't hear whether she said DON'T press the button, or press it. I didn't know what the button was for, but I thought it might have some crucial consequence if I didn't follow her directions. So I called her, as she was walking away, and she didn't answer. Mr. Dell was walking behind her, so I called Mr. Dell, and he said he'd get Mrs. Pappas to come back to tell me what to do, but she never did, as far as I remember. Then I remember sitting at a table, probably outside, and eating, with Mrs. Saint and some others. All I remember is that I couldn't hear much, and I had to keep asking these kids at a nearby table to repeat what they were saying to me- when I did, some people just laughed and told me to forget it, but I really wanted to know what they were talking about. I felt excluded. I also remember Mrs. Jones showing me something outside the school. I don't remember what it was. Probably I had this dream because when I fell asleep, I'd just gotten back from Plainview High School and I'd seen my old teachers."
        }, 
        {
            "number": "009", 
            "head": "03/04/2000", 
            "content": "I remember not really being involved for most of this dream. Like a movie, where I'm there, but just watching, and nobody else notices I'm there. It was about a boy, and I think a girl, either his sister or mother probably. The boy is being taken somewhere through the ceiling of the basement (that I think is my grandfather's basement) by an evil superman look-alike. The girl doesn't know what's happening to her little brother/son. There was more, but it's so foggy in my memory I can't describe it. The next thing I know, I'm in my kitchen, and there's a bunch of people there- an electrical unit or something near the door, from what I remember (although I don't know what that has to do with anything), and we sort of \"slid\" out of the house. I don't exactly remember, it was almost like a waterslide, maybe. Then, I fell until I was at the other side of the driveway and then suddenly realized I had no clothes on. At that point, everybody was getting ready to start a fantasy baseball draft. The first draft pick went to the \"Jethros\"- i.e. Jethro Tull (last guitar lesson, I told my guitar teacher I didn't really like Jethro Tull and he said he's never heard of anyone who didn't)."
        }, 
        {
            "number": "010", 
            "head": "03/05/2000", 
            "content": "Most of the dream takes place at night. I'm running continuously through a place that looks sort of like my town. I half realize I'm dreaming, but not really. I just remember thinking that it's so easy to run in a dream without getting out of breath, and how fun running is in dreams. Although it looked a lot like my town, I get a feeling at some point I was a long way from my hometown. I just remember asking someone where the bank was. Since I knew I was dreaming, I wanted to rob a million dollars from the bank and \"play liar liar\" was what I called it (I don't exactly understand why, except that in the movie \"Liar Liar\" Jim Carey played the part of a lawyer who couldn't tell the truth). Having fun playing cops and robbers in my sleep, for real. I never got to the bank or anything. Again, if I really knew I was dreaming, I would have known that I didn't need money in the dream world and just done whatever I wanted. Oh, there were also a few things about lucid dreaming I thought up, during my dream. I remember thinking, at one point during my dreaming, \"I wonder if I can hypnotize myself while I'm dreaming so I'll be different in some way when I wake up,\" and someone told me that thinking of some of your idiosyncrasies in real life will make your dream stronger when it's fading. Somehow it worked for me, but it was so crazy, it probably worked only by the power of suggestion (besides, I was thinking of things like, \"I don't shower enough\" as idiosyncrasies)."
        }, 
        {
            "number": "011", 
            "head": "03/13/2000", 
            "content": "I dreamed I was in a big room, with lots of people. There were tables, but I didn't see any food. Bernice was there, and there is a brief sexual scene between us. I guess we were in school, or at a school event, because after that, I was very afraid that everyone had seen and that I could be kicked out of school. I pretended the whole thing was \"a show,\" walking around to every table asking everyone \"how do you like the show?\". I didn't feel like anyone was there at the time. I felt \"they\" were looking for me, and would catch me any minute. Then there was a girl who I sat next to, and told her what a surprise, that I'll love her forever (and I don't just say those things, believe me, I really mean them. I sound like Holden Caulfield from Catcher in the Rye, I know- but I know exactly how that kid felt). Then I heard somebody call my name, and I knew I'd be in huge trouble. The strange thing, though, is that it wasn't my name. I can't remember what they called me, but it seemed natural like it was really my name. So, I brought this girl through the nearest door and downstairs. I kept telling her to run faster, but I didn't run away because I felt safer with her around. As far as I remember, I got out. Then, I remember thinking I had woken up, and coming outside my house to see a school bus in my driveway. I thought the bus might have been from my dream, and realized in that case it could have been from anywhere in the world. I looked at the location on the side, and it said it was from somewhere in CA, which, instead of making it out to mean \"West Coast,\" I thought it meant \"Central America.\" I also remember getting a phone call and being called into the studio of the radio station ABCD at the nearby university- but it wasn't a small studio room, it was more like a big gymnasium. If I remember, not everybody had all their clothes on (some of the guys had their shirts off, I think) and the main guy there reminded me of one of the early morning guys on WAAF."
        }, 
        {
            "number": "012", 
            "head": "03/23/2000", 
            "content": "The first thing I remember is holding a CD in my hand, and then all of a sudden being able to hear the music perfectly in my head. I was amazed by my ability, although I wasn't sure if I thought I was awake or asleep at the time. I don't remember what disc I was listening to either, but I do remember my brother saying something about a band called \"[something] Hill\" and then I thought about the band Sugar Hill that DC Talk sings about on one of their albums. So, I think I was going to put my DC Talk CD into the player. At that point, I remember going \"unconscious\"- I started seeing pictures in my head or something, and I really felt like it was another form of consciousness. The next thing I know, I'm in my bed reading. I come across this passage, but I never really know what it's saying because every time I read it I go unconscious. I read this passage several times, but I'm never able to finish because I just black out to another world, temporarily (it only seemed like a few seconds each time). Anyway, finally I was able to read most of it, and I remember something to the general effect of (paraphrasing): \"According to the research of [John Smith], every time [certain phrase] is written, people are proven to go unconscious, because when you really believe something, it will happen.\" I think I still blacked out, even after the disappointment of somebody actually TELLING me that this technique was just a placebo (I really could have killed that guy for spoiling it!), but at least I was able to read more of it that time- enough to understand what it was saying."
        }, 
        {
            "number": "013", 
            "head": "03/26/2000", 
            "content": "I remember walking into physics class, and my teacher letting me make up a test. In the dream she told me specifically, \"You got so many problems wrong, it wouldnÕt be fair to let you do the test at home, so youÕll have to get at least a couple problems done now.\" I remember thinking, \"WHY DOESN'T SHE TELL US ABOUT THESE THINGS BEFOREHAND!\" IÕm searching for my problems, and a pen and everything and I couldn't even find everything. Then, I remember her giving me a paper that said pretty much, \"I'm very disappointed in you, I don't even know why you're here.\" There was something else in this dream sequence, something a little more positive (maybe it wasn't, but that's my waking impression).I don't really remember that part. I just remember it was a trip somewhere with some girl who's identity I'm unsure of. I don't remember why, with whom, or anything about it."
        }, 
        {
            "number": "014", 
            "head": "03/26/2000", 
            "content": "I had a dream that someone told me I missed Christmas- and I balled my eyes out. I was told I'd still get presents and everything, but I kept crying and saying, It's not the same.\" Actually, this is what I think happened: I was watching something on TV, but it seemed more like I was watching people in the other room on a television-like screen. Then, someone came in and broke the news. I was heartbroken."
        }, 
        {
            "number": "015", 
            "head": "04/01/2000", 
            "content": "I dreamed I was going to sleep within a dream, with the purpose of recording my lucid dream when I woke up. I had this device that let me easily have lucid dreams, I think. Then, (now dream within dream) I remember thinking I was lucid, and I was somewhat lucid. I saw some words posted somewhere- I tried to memorize them so I'd remember then when I woke up. I don't remember what the words were, except the letter \"E\" was probably the first letter in two of the words, and there were 4 words I memorized. Then I remember being in or near a nurse's office, and then going through this room with a 4 foot ceiling and dust floors, where a lot of army men were eating and hanging out. I was just glad I wasn't in the army, and as I left the room I tried very hard not to get dusty. I had a strange feeling that I was at camp or something, and I wasn't going to be able to wash for a while. Anyway, I forget what happened after I woke from this semi-lucid dream-dream, except that I tried to record the words but couldn't remember them."
        }
    ]
}